{"ioc":"site111.mallmaster.top","ioc_type":"domain","threat_level":"HIGH","detection_summary":"Detected malicious activity with 10 positive detections across various AV vendors. The domain has strong associations with Android malware.","detection_ratio":"10/95","discovered_relationships":[{"relationship_type":"referring_file","indicator":"classes.dex","context":"Multiple Android files labeled as 'classes.dex' have shown up with significant detection rates, indicating possible distribution of malicious APKs.","detection_stats":"Detection statistics show harmful activity with a consistent pattern among multiple files.","confidence":"HIGH"},{"relationship_type":"contacted_ip","indicator":"91.195.240.12","context":"One of several resolved IPs associated with the domain, linked to reported malicious activity.","detection_stats":"Malicious detections associated with domain activity.","confidence":"HIGH"}],"priority_discoveries":[{"priority_rank":1,"discovery":"Multiple Android APKs with high detection rates related to the domain.","significance":"The presence of multiple APKs with 20+ detection rates indicates widespread malicious activity and potential for impact.","recommended_specialist":"Elite Malware Behavioral Analysis Expert","confidence":"HIGH"},{"priority_rank":2,"discovery":"IP addresses resolved to the domain","significance":"Potential infrastructure links that warrant further assessment to map out the threat campaign.","recommended_specialist":"Master Infrastructure Hunter and Campaign Correlation Expert","confidence":"MEDIUM"}],"recommended_next_steps":["Recall Elite Malware Behavioral Analysis Expert to analyze malicious APKs linked to the domain for further understanding of behavior and potential impacts.","Engage Master Infrastructure Hunter and Campaign Correlation Expert to explore the infrastructure associated with the resolved IPs and conduct campaign correlation."],"analytical_summary":"Triage analysis of 'site111.mallmaster.top' shows significant malicious presence predominantly linked to Android malware distribution. Ongoing connections to certain IPs and multiple APK files indicate high threat potential, justifying deeper investigation and specialist involvement."}